# -*- coding: utf8 -*-

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#----------------------------------------------------------------------------------------------------------------
print('---------------------------------------------------------------------------------------------')

print('Обработка запроса...')

data = {
    'Name': ['Витя', 'Лёха', 'Мишаня', 'Артём'],
    'Tracks': [112, 56, 34, 105],
    'Likes': [1053321, 35474, 23456, 986521]
}

print('Создаём CSV файл...')

dataframe = pd.DataFrame(data)

print('Заполняем файл информацией...')

dataframe.to_csv('sample_data.csv', index=False)

print('Файл sample_data.csv успешно создан и готов к сипользованию!')

print('----------------------------------------------')

print('Чтение CSV файла')

dataframe = pd.read_csv('sample_data.csv')

print('Первые 5 строк данных:\n', dataframe.head())
print('Информация о данных:\n', dataframe.info())
print('Статистика данных:\n', dataframe.describe())

#----------------------------------------------------------------------------------------------------------------
print('---------------------------------------------------------------------------------------------')

print('Создание массива чисел')

array = np.array([1, 2, 3, 4, 5])

squared = np.square(array)
mean = np.mean(array)
std = np.std(array)

print('Исходный массив:', array)
print('Квадраты элементов:', squared)
print('Среднее значение:', mean)
print('Отклонение:', std)

#----------------------------------------------------------------------------------------------------------------
print('---------------------------------------------------------------------------------------------')

print('Анализируем данные для графика...')

x = np.linspace(0, 10, 100)
y = np.sin(x)

print('Создание графика...')

plt.plot(x, y, label='wave')

plt.xlabel('x value')
plt.ylabel('sin(x)')
plt.title('wave')
plt.legend()

print('Вот ваш график!)')

plt.show()