
def get_name():
    name = input('Введите ваше имя >>> ')
    return name


def say_hello(name):
    print('-------------------------------------------------------')
    print(f'Добро пожаловать, {name}, вы успешно прошли регистрацию')
    print('-------------------------------------------------------')


def say_bye(name):
    print(f'Были рады вас видеть на нашей площадке, {name}, возвращайтесь ещё!')


usrname = get_name()

say_hello(usrname)

print("Что вы хотите сделать?")
print("1. Выйти            _2. Coming soon...")
print('-------------------------------------------------------')

choice = input("Введите цифру действия")

if choice == '1':
    print('-------------------------------------------------------')
    say_bye(usrname)